In [2]:
#7.1 处理缺失数据
import numpy as np
import pandas as pd
string_data = pd.Series(['aard','artich',np.nan,'avocado'])
string_data

0       aard
1     artich
2        NaN
3    avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -1.127312       NaN       NaN
1 -0.472001       NaN       NaN
2 -0.732649       NaN  0.279945
3  0.950799       NaN  0.863697
4  0.519213 -0.274737 -1.140625
5 -0.626279  0.053056  0.435114
6 -0.297686 -0.200848  1.935499

In [21]:
df.dropna()

          0         1         2
4  0.519213 -0.274737 -1.140625
5 -0.626279  0.053056  0.435114
6 -0.297686 -0.200848  1.935499

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -0.732649       NaN  0.279945
3  0.950799       NaN  0.863697
4  0.519213 -0.274737 -1.140625
5 -0.626279  0.053056  0.435114
6 -0.297686 -0.200848  1.935499

In [23]:
df.fillna(0)

          0         1         2
0 -1.127312  0.000000  0.000000
1 -0.472001  0.000000  0.000000
2 -0.732649  0.000000  0.279945
3  0.950799  0.000000  0.863697
4  0.519213 -0.274737 -1.140625
5 -0.626279  0.053056  0.435114
6 -0.297686 -0.200848  1.935499

In [24]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.127312  0.500000  0.000000
1 -0.472001  0.500000  0.000000
2 -0.732649  0.500000  0.279945
3  0.950799  0.500000  0.863697
4  0.519213 -0.274737 -1.140625
5 -0.626279  0.053056  0.435114
6 -0.297686 -0.200848  1.935499

In [25]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0 -1.127312  0.000000  0.000000
1 -0.472001  0.000000  0.000000
2 -0.732649  0.000000  0.279945
3  0.950799  0.000000  0.863697
4  0.519213 -0.274737 -1.140625
5 -0.626279  0.053056  0.435114
6 -0.297686 -0.200848  1.935499

In [26]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0 -0.167029 -0.402898  0.538510
1 -1.226596 -1.917435 -0.292688
2  0.121586       NaN  0.150426
3 -1.445428       NaN  0.627381
4  0.935312       NaN       NaN
5 -1.234939       NaN       NaN

In [29]:
df.fillna(method='ffill')

          0         1         2
0 -0.167029 -0.402898  0.538510
1 -1.226596 -1.917435 -0.292688
2  0.121586 -1.917435  0.150426
3 -1.445428 -1.917435  0.627381
4  0.935312 -1.917435  0.627381
5 -1.234939 -1.917435  0.627381

In [28]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.167029 -0.402898  0.538510
1 -1.226596 -1.917435 -0.292688
2  0.121586 -1.917435  0.150426
3 -1.445428 -1.917435  0.627381
4  0.935312       NaN  0.627381
5 -1.234939       NaN  0.627381

In [30]:
data = pd.Series([1,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
#数据转换
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data['v1']=range(7)

In [37]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastra','corned','Bacon','pastra','honey','nova'],'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3       Pastra     6.0
4       corned     7.5
5        Bacon     8.0
6       pastra     3.0
7        honey     5.0
8         nova     6.0